microchip-pic-avr-examples/avr128db28-smart-security-sensor-mplab/avr128db48-mlx90392-mplab-mcc.X/windowAlarm.c
#include "mcc_generated_files/system/system.h"
#include "mcc_generated_files/timer/delay.h"

#include <xc.h>
#include <stdint.h>
#include <stdbool.h>
#include <math.h>
#include <stdio.h>

#include "printUtility.h"
#include "windowAlarm.h"
#include "windowAlarm_config.h"
#include "MLX90392.h"
#include "EEPROM_Locations.h"
#include "EEPROM_Utility.h"
#include "MVIO.h"
#include "windowAlarm_messages.h"

//Enumeration for the Measurement State Machine
typedef enum {
MAGNETOMETER_START = 0, MAGNETOMETER_WAIT, MAGNETOMETER_ERROR, 
        MAGNETOMETER_REINIT_WAIT, MAGNETOMETER_REINIT
} MagentometerMeasState;

//Enumeration for Calibration State Machine
typedef enum{
    CAL_BAD = 0, CAL_INIT, CAL_OPEN_WAIT, CAL_OPEN, CAL_CLOSED_WAIT, CAL_CLOSED, 
            CAL_CRACKED_WAIT, CAL_CRACKED_ERR, CAL_CRACKED, CAL_CLOSED_FINAL_WAIT, 
            CAL_DEINIT, CAL_GOOD
} MagnetometerCalibrationState;

//Enumeration for the Result Printing State Machine
typedef enum{
    WINDOW_CLOSED = 0, WINDOW_CRACKED, WINDOW_OPEN, INVALID
} MagnetometerResultState;

//Calibration Status
static MagnetometerCalibrationState calState = CAL_BAD;
static MagnetometerResultState prevResultState = INVALID;

//State Machine Variables
static volatile MagentometerMeasState magState = MAGNETOMETER_START;
static volatile uint16_t magCounter = MAGNETOMETER_ERROR_DELAY;

//Alarm Parameters
static uint32_t crackedV, maxV;
static int16_t offsetX = 0, offsetY = 0, offsetZ = 0;
static uint8_t scaleX = 1, scaleY = 1, scaleZ = 1;

static bool buttonPressed = false, lastButtonState = false;

//Angle Ranges
#ifdef MAGNETOMETER_ANGLE_CHECK
static int16_t minXY, maxXY, minXZ, maxXZ, minYZ, maxYZ;
#endif

//ID of Magnetometer
static uint8_t sensorID = 0x00;

//Alarm Count
static uint8_t alarmState = 0;

uint8_t _windowAlarm_computeScalingFactor(int16_t result)
{
    uint8_t scale = 1;
    
    //Negate Input
    if (result < 0)
    {
        result *= -1;
    }
 
    //While result doesn't fit in an 7-bit number
    while (result > 127)
    {
        result = result >> 1;
        scale++;
    }
    
    return scale;
}

void windowAlarm_updateAngleMaxMin(MLX90392_NormalizedResults* normResults)
{
#ifdef MAGNETOMETER_ANGLE_CHECK
    if (minXY > normResults->xyAngle)
    {
        minXY = normResults->xyAngle;
    }
    else if (normResults->xyAngle > maxXY)
    {
        maxXY = normResults->xyAngle;
    }

    if (minXZ > normResults->xyAngle)
    {
        minXZ = normResults->xyAngle;
    }
    else if (normResults->xyAngle > maxXZ)
    {
        maxXZ = normResults->xyAngle;
    }

    if (minYZ > normResults->xyAngle)
    {
        minYZ = normResults->xyAngle;
    }
    else if (normResults->xyAngle > maxYZ)
    {
        maxYZ = normResults->xyAngle;
    }
#endif
}

//Internal function for setting the trigger thresholds (calibration)
void windowAlarm_runCalibration(MLX90392_RawResult* rawResult, MLX90392_NormalizedResults* normResults)
{
    static MagnetometerCalibrationState oldState = CAL_BAD;
    static uint16_t sampleCount = 0, instructionCount = 0;
    static uint8_t blinkCount = 0;
    
    //Digital Counter to blink the LED
    if (blinkCount >= MAGNETOMETER_CAL_BLINK_PERIOD)
    {
        LED0_Toggle();
        blinkCount = 0;
    }
    else
    {
        blinkCount++;
    }
    
    //Update Angle Max and Min
#ifdef MAGNETOMETER_ANGLE_CHECK
    windowAlarm_updateAngleMaxMin(normResults);
#endif
    
    //Monitor field strength, record strongest magnitude
    if (normResults->r2 > maxV)
    {
        maxV = normResults->r2;
    }
    
    //Averages for zeroing
    static int32_t averageX, averageY, averageZ, averageR2;
    
    switch (calState)
    {
        case CAL_BAD:
        {
            
//            printConstantStringBLE("Open the window and press the button to start.\r\n");
            //Configure Instructions State Machine
            oldState = CAL_BAD;
                    
            //Advance State Machine
            calState = CAL_INIT;
            
            //Clear Averaging Variables
            averageX = 0;
            averageY = 0;
            averageZ = 0;
            break;
        }
        case CAL_INIT:
        {
            if (MLX90392_setOperatingMode(MAGNETOMETER_CAL_SAMPLE_RATE))
            {                
                calState = CAL_OPEN_WAIT;
            }
            else
            {
                printConstantStringUSB("[ERR] Failed to change MLX90392 operating mode.\r\n");
            }
            break;
        }
        case CAL_OPEN_WAIT:
        {
            if (buttonPressed)
            {
                printConstantStringBLE("Beginning open window calibration.\r\n");
                calState = CAL_OPEN;
                sampleCount = 0;
            }
            break;
        }
        case CAL_OPEN:
        {
            sampleCount++;
            
            //Accumulate Results
            averageX += rawResult->X_Meas;
            averageY += rawResult->Y_Meas;
            averageZ += rawResult->Z_Meas;
            
            if (sampleCount >= MAGNETOMETER_CALIBRATION_SAMPLES)
            {
                //Compute Average Offset
                offsetX = round(averageX / MAGNETOMETER_CALIBRATION_SAMPLES);
                offsetY = round(averageY / MAGNETOMETER_CALIBRATION_SAMPLES);
                offsetZ = round(averageZ / MAGNETOMETER_CALIBRATION_SAMPLES);
                
                //Print Debug Info
                sprintf(getCharBufferUSB(), "Zeroing Complete. X_off = %d, Y_off = %d, Z_off= %d\r\n", offsetX, offsetY, offsetZ);
                printBufferedStringUSB();
                
                //Update State
                calState = CAL_CLOSED_WAIT;            
            }
            break;
        }
        case CAL_CLOSED_WAIT:
        {
            if (buttonPressed)
            {
                //Reset maximum value
                maxV = 0;
                
                printConstantStringBLE("Beginning closed window calibration.\r\n");
                calState = CAL_CLOSED;
                sampleCount = 0;
            }
            break;
        }
        case CAL_CLOSED:
        {                        
            sampleCount++;
            
            //Accumulate results
            averageX += (rawResult->X_Meas - offsetX);
            averageY += (rawResult->Y_Meas - offsetY);
            averageZ += (rawResult->Z_Meas - offsetZ);
            
            if (sampleCount >= MAGNETOMETER_CALIBRATION_SAMPLES)
            {
                //Compute Average
                averageX = round(averageX / MAGNETOMETER_CALIBRATION_SAMPLES);
                averageY = round(averageY / MAGNETOMETER_CALIBRATION_SAMPLES);
                averageZ = round(averageZ / MAGNETOMETER_CALIBRATION_SAMPLES);
                
