microchip-pic-avr-examples/avr128db28-smart-security-sensor-mplab/avr128db48-mlx90392-mplab-mcc.X/windowAlarm.c
                //Compute Scaling Factor
                scaleX = _windowAlarm_computeScalingFactor(averageX);
                scaleY = _windowAlarm_computeScalingFactor(averageY);
                scaleZ = _windowAlarm_computeScalingFactor(averageZ);
                
                sprintf(getCharBufferUSB(), "Scaling Completed. X_scale  = 2^%d, Y_scale = 2^%d, Z_scale = 2^%d\r\n",
                        scaleX, scaleY, scaleZ);
                printBufferedStringUSB();

                //Advance State Machine
                calState = CAL_CRACKED_WAIT;
                
#ifdef MAGNETOMETER_ANGLE_CHECK
                //Compute Normalized Results Immediately from New Values
                windowAlarm_createNormalizedResults(rawResult, normResults);
                
                //Init Angles
                minXY = normResults->xyAngle;
                maxXY = normResults->xyAngle;
                
                minXZ = normResults->xzAngle;
                maxXZ = normResults->xzAngle;
                
                minYZ = normResults->yzAngle;
                maxYZ = normResults->yzAngle;
#endif
            }
            break;
        }
        case CAL_CRACKED_WAIT:
        {                        
            if (normResults->r2 <= MAGNETOMETER_NOISE_MARGIN)
            {
                printConstantStringUSB("[ERR] Sensor value is below noise margin, please close the window and press the button to retry.\r\n");
                calState = CAL_CRACKED_ERR;
            }
            else if (buttonPressed)
            {
                printConstantStringBLE("Beginning window threshold calibration.\r\n");
                
                //Init Variables
                sampleCount = 0;
                averageR2 = 0;
                
                //Update State
                calState = CAL_CRACKED;
            }
            break;
        }
        case CAL_CRACKED_ERR:
        {
            if (buttonPressed)
            {                
#ifdef MAGNETOMETER_ANGLE_CHECK
                //Init Angles
                minXY = normResults->xyAngle;
                maxXY = normResults->xyAngle;
                
                minXZ = normResults->xzAngle;
                maxXZ = normResults->xzAngle;
                
                minYZ = normResults->yzAngle;
                maxYZ = normResults->yzAngle;
#endif
                //Update State
                calState = CAL_CRACKED_WAIT;
            }
            break;
        }
        case CAL_CRACKED:
        {   
            //Increment Counter
            sampleCount++;
            
            //Accumulate Values
            averageR2 += normResults->r2;
            
            if (sampleCount >= MAGNETOMETER_CALIBRATION_SAMPLES)
            {
                //Set Cracked Threshold
                crackedV = round(averageR2 / MAGNETOMETER_CALIBRATION_SAMPLES);

                //Warning for Low Noise Margin
                if (crackedV < MAGNETOMETER_NOISE_MARGIN)
                {
                    printConstantStringUSB("[WARN] Threshold is below noise margin. Sensor may not operate correctly.\r\n");
                }
                
                //Apply Tolerance, if set
#ifdef MAGNETOMETER_VECTOR_TOLERANCE
                crackedV = round(crackedV * (1.0 + MAGNETOMETER_VECTOR_TOLERANCE));
                maxV = round(maxV * (1.0 + MAGNETOMETER_VECTOR_TOLERANCE));
#endif
                
                //Print Threshold
                sprintf(getCharBufferUSB(), "Threshold calibration complete. Threshold: %lu\r\n", crackedV);
                printBufferedStringUSB();
                                                
                //Update Cal State
                calState = CAL_CLOSED_FINAL_WAIT;
            }
            break;
        }
        case CAL_CLOSED_FINAL_WAIT:
        {
            if (buttonPressed)
            {
#ifdef MAGNETOMETER_ANGLE_CHECK
                
                //If set, add tolerance to the angles
#ifdef MAGNETOMETER_ANGLE_TOLERANCE
                minXY -= MAGNETOMETER_ANGLE_TOLERANCE;
                maxXY += MAGNETOMETER_ANGLE_TOLERANCE;
                
                minXZ -= MAGNETOMETER_ANGLE_TOLERANCE;
                maxXZ += MAGNETOMETER_ANGLE_TOLERANCE;
                
                minYZ -= MAGNETOMETER_ANGLE_TOLERANCE;
                maxYZ += MAGNETOMETER_ANGLE_TOLERANCE;
#endif
                
                //Print Angle Range
                sprintf(getCharBufferUSB(), "Allowed Angles: %d < XY < %d, %d < XZ < %d, %d < YZ < %d\r\n",
                        minXY, maxXY, minXZ, maxXZ, minYZ, maxYZ);
                printBufferedStringUSB();
#endif
                
                printConstantStringBLE("Calibration Completed.\r\n");
                calState = CAL_DEINIT;
                
                //Clear the blink counter
                blinkCount = 0;
                
                //Save values to EEPROM
                windowAlarm_saveThresholds();

            }
            break;
        }
        case CAL_DEINIT:
        {
            if (MLX90392_setOperatingMode(MAGNETOMETER_ACTIVE_SAMPLE_RATE))
            {
                calState = CAL_GOOD;
            }
            else
            {
                printConstantStringUSB("[ERR] Failed to change MLX90392 operating mode.\r\n");
            }
            break;
        }
        case CAL_GOOD:
        {
            //Move to bad state
            calState = CAL_BAD;
            break;
        }
    }
    
    //Instruction Printing State Machine
    if ((oldState != calState) || (instructionCount >= INSTR_REPEAT_ITERATIONS))
    {
        //Print Instructions
        printConstantStringBLE(calInstructions[calState]);
        
        //Update old state
        oldState = calState;
        
        //Reset Timer
        instructionCount = 0;
    }
    else
    {
        instructionCount++;
    }
}

void windowAlarm_init(bool safeStart)
{
    bool success;
    
    //Print Welcome
    printConstantStringUSB("Initializing MLX90392 Magnetometer Sensor...");
    
    //Init Sensor
    success = MLX90392_init();

    //If unable to init...
    if (!success)
    {
        printConstantStringUSB("FAILED\r\n");
        magState = MAGNETOMETER_ERROR;
        return;
    }
    
    //If unable to init EEPROM constants
    if (!windowAlarm_loadFromEEPROM(safeStart))
    {
        printConstantStringUSB("CAL BAD\r\n");
        calState = CAL_BAD;
        return;
    }
    
