microchip-pic-avr-examples/avr128db28-smart-security-sensor-mplab/avr128db48-mlx90392-mplab-mcc.X/windowAlarm.c
    printConstantStringUSB("OK\r\n");
}

//Tries to load constants from EEPROM - called by windowAlarm_init
//Returns true if successful, or false if EEPROM is invalid
bool windowAlarm_loadFromEEPROM(bool safeStart)
{
    //Set Calibration Status
    calState = CAL_BAD;
    
    uint8_t _verify_sensorID;
    bool success = MLX90392_getRegister(MLX90392_DEVICE_ID, &_verify_sensorID);
    
    if (!success)
        return false;
    
    uint8_t EEPROM_id_test = get8BFromEEPROM(EEPROM_MLX90392_ID);
    
    if ((!safeStart) && (EEPROM_id_test == _verify_sensorID))
    {       
        //EEPROM is valid, load thresholds
        
        //Window Vector Threshold
        crackedV = get32BFromEEPROM(CRACKED_THRESHOLD_V);
        
        //Max Allowed Vector Strength
        maxV = get32BFromEEPROM(MAX_VALUE_V);
        
        //Offsets
        offsetX = get16BFromEEPROM(MAGNETOMETER_OFFSET_X);
        offsetY = get16BFromEEPROM(MAGNETOMETER_OFFSET_Y);
        offsetZ = get16BFromEEPROM(MAGNETOMETER_OFFSET_Z);
        
        //Scaling Values
        scaleX = get8BFromEEPROM(MAGNETOMETER_SCALER_X);
        scaleY = get8BFromEEPROM(MAGNETOMETER_SCALER_Y);
        scaleZ = get8BFromEEPROM(MAGNETOMETER_SCALER_Z);
        
#ifdef MAGNETOMETER_ANGLE_CHECK
        
        //Angle Ranges
        minXY = get16BFromEEPROM(MAGNETOMETER_MIN_XY);
        maxXY = get16BFromEEPROM(MAGNETOMETER_MAX_XY);
        minXZ = get16BFromEEPROM(MAGNETOMETER_MIN_XZ);
        maxXZ = get16BFromEEPROM(MAGNETOMETER_MAX_XZ);
        minYZ = get16BFromEEPROM(MAGNETOMETER_MIN_YZ);
        maxYZ = get16BFromEEPROM(MAGNETOMETER_MAX_YZ);
        
#endif      
        calState = CAL_GOOD;
        
        return true;
    }
    return false;
}

//Converts raw results into a normalized compressed value
void windowAlarm_createNormalizedResults(MLX90392_RawResult* raw, MLX90392_NormalizedResults* results)
{
    if (scaleX < 0)
    {
        //Inverted Result
        results->x = -1 * ((raw->X_Meas - offsetX) >> (scaleX * -1));
    }
    else
    {
        //Non-Inverted Result
        results->x = (raw->X_Meas - offsetX) >> (scaleX);
    }
    
    if (scaleY < 0)
    {
        //Inverted Result
        results->y = -1 * ((raw->Y_Meas - offsetY) >> (scaleY * -1));
    }
    else
    {
        //Non-Inverted Result
        results->y = (raw->Y_Meas - offsetY) >> (scaleY);
    }
    
    if (scaleZ < 0)
    {
        //Inverted Result
        results->z = -1 * ((raw->Z_Meas - offsetZ) >> (scaleZ * -1));
    }
    else
    {
        //Non-Inverted Result
        results->z = (raw->Z_Meas - offsetZ) >> (scaleZ);
    }
    
    results->r2 = (uint16_t)(results->x * results->x) + 
            (uint16_t)(results->y * results->y) + 
            (uint16_t)(results->z * results->z);
    
#ifdef MAGNETOMETER_ANGLE_CHECK
    
    if (MAGNETOMETER_NOISE_MARGIN <= results->r2)
    {
        if (results->y != 0)
            results->xyAngle = round((/*abs(results->x) * */ results->x * MAGNETOMETER_ANGLE_SCALE) /
                    (/*abs(results->y) * */ results->y));
        else
            results->xyAngle = 0;

        if (results->z != 0)
        {
            results->xzAngle = round((/*abs(results->x) * */ results->x * MAGNETOMETER_ANGLE_SCALE) / 
                    (/*abs(results->z) * */ results->z));
            results->yzAngle = round((/*abs(results->y) * */ results->y * MAGNETOMETER_ANGLE_SCALE) / 
                    (/*abs(results->z) * */ results->z));
        }
        else
        {
            results->xzAngle = 0;
            results->yzAngle = 0;
        }
    }
    else
    {
        results->xyAngle = 0;
        results->xzAngle = 0;
        results->yzAngle = 0;
    }
#else
    //Set values to 0
    results->xyAngle = 0;
    results->xzAngle = 0;
    results->yzAngle = 0;
#endif
    
}

void windowAlarm_processResults(MLX90392_NormalizedResults* normResults)
{
    static uint8_t counter = 0;
    bool alarmOK = false;

    if ((normResults->r2 >= crackedV) && (normResults->r2 <= maxV))
    {
        //Within Expected Intensity

#ifdef MAGNETOMETER_ANGLE_CHECK        
        //Check Angles
        if ((normResults->xyAngle > maxXY) || (normResults->xyAngle < minXY))
        {
            alarmOK = false;
#ifdef MAGNETOMETER_DEBUG_PRINT
            sprintf(getCharBufferUSB(), "XY Range: %d < XY < %d, found %d\r\n", minXY, maxXY, normResults->xyAngle);
            printBufferedStringUSB();
            printConstantStringUSB("<XY Angle Error> - ");
#endif 
        }
        else if ((normResults->xzAngle > maxXZ) || (normResults->xzAngle < minXZ))
        {
            alarmOK = false;
#ifdef MAGNETOMETER_DEBUG_PRINT
            sprintf(getCharBufferUSB(), "XZ Range: %d < XZ < %d, found %d\r\n", minXZ, maxXZ, normResults->xzAngle);
            printBufferedStringUSB();
            printConstantStringUSB("<XZ Angle Error> - ");
#endif 
        }
        else if ((normResults->xzAngle > maxXZ) || (normResults->xzAngle < minXZ))
        {
            alarmOK = false;
#ifdef MAGNETOMETER_DEBUG_PRINT
            sprintf(getCharBufferUSB(), "YZ Range: %d < YZ < %d, found %d\r\n", minYZ, maxYZ, normResults->yzAngle);
            printBufferedStringUSB();
            printConstantStringUSB("<YZ Angle Error> - ");
#endif 
        }
        else
        {
            alarmOK = true;
        }
#else
        alarmOK = true;
#endif

    }
    else
    {
#ifdef MAGNETOMETER_DEBUG_PRINT
        sprintf(getCharBufferUSB(), "Max Value: %lu, Cracked: %lu, found %lu\r\n", maxV, crackedV, normResults->r2);
        printBufferedStringUSB();
        printConstantStringUSB("<Threshold Exceeded> - ");
#endif 
    }
    
    if (alarmOK)
    {
        if (alarmState != 0)
        {
            alarmState--;
        }
        LED0_SetLow();
    }
    else
    {
        if (alarmState != MAGNETOMETER_ALARM_TRIGGER_MAX)
        {
            alarmState++;
        }
        LED0_SetHigh();
    }
        
    if ((counter == MAGNETOMETER_ALARM_PRINT_RATE) || (alarmState == MAGNETOMETER_ALARM_TRIGGER))
    {
        if (alarmState >= MAGNETOMETER_ALARM_TRIGGER)
        {
            printConstantStringBLE("Alarm BAD\n");
        }
        else
        {
            printConstantStringBLE("Alarm OK\n");
        }

        counter = 0;
    }
    else
    {
        counter++;
    }
 }

//Saves current calibration parameters
bool windowAlarm_saveThresholds(void)
{    
    if (!MLX90392_getRegister(MLX90392_DEVICE_ID, &sensorID))
        return false;
        
