microchip-pic-avr-examples/avr128db28-smart-security-sensor-mplab/avr128db48-mlx90392-mplab-mcc.X/windowAlarm.c
    save32BToEEPROM(CRACKED_THRESHOLD_V, crackedV);
    save32BToEEPROM(MAX_VALUE_V, maxV);
    
    save16BToEEPROM(MAGNETOMETER_OFFSET_X, offsetX);
    save16BToEEPROM(MAGNETOMETER_OFFSET_Y, offsetY);
    save16BToEEPROM(MAGNETOMETER_OFFSET_Z, offsetZ);
    
    save8BToEEPROM(MAGNETOMETER_SCALER_X, scaleX);
    save8BToEEPROM(MAGNETOMETER_SCALER_Y, scaleY);
    save8BToEEPROM(MAGNETOMETER_SCALER_Z, scaleZ);
    
#ifdef MAGNETOMETER_ANGLE_CHECK
    
    save16BToEEPROM(MAGNETOMETER_MIN_XY, minXY);
    save16BToEEPROM(MAGNETOMETER_MAX_XY, maxXY);
    save16BToEEPROM(MAGNETOMETER_MIN_XZ, minXZ);
    save16BToEEPROM(MAGNETOMETER_MAX_XZ, maxXZ);
    save16BToEEPROM(MAGNETOMETER_MIN_YZ, minYZ);
    save16BToEEPROM(MAGNETOMETER_MAX_YZ, maxYZ);
    
#endif
    
    //Write the ID of the sensor
    save8BToEEPROM(EEPROM_MLX90392_ID, sensorID);

    return true;
}

//Returns true if calibration is good
bool windowAlarm_isCalGood(void)
{
    return (calState == CAL_GOOD);
}

void windowAlarm_FSM(void)
{    
    //Software button debouncer
    //Button is cleared at the end of MAGNETOMETER_WAIT
    if ((!lastButtonState) && (SW0_GetValue()))
    {
        //Button is pressed
        lastButtonState = true;
        buttonPressed = true;
    }
    else if ((lastButtonState) && (!SW0_GetValue()))
    {
        //Button released (reset state machine)
        lastButtonState = false;
    }
    
    bool success;
    
    //MLX90392 Magnetometer State Machine
    switch (magState)
    {
        case MAGNETOMETER_START:
        {                        
            //Configure Conversion Rates
            if (calState == CAL_GOOD)
            {
                //Monitor Mode - Low Speed, Low Power
                success = MLX90392_setOperatingMode(MAGNETOMETER_ACTIVE_SAMPLE_RATE);
            }
            else
            {
                //Calibration Mode - Higher Speed Operation
                success = MLX90392_setOperatingMode(MAGNETOMETER_CAL_SAMPLE_RATE);
            }
            

            //Move to next state
            if (success)
            {
                magState = MAGNETOMETER_WAIT;
            }
            else
            {
                //Something went wrong
                magState = MAGNETOMETER_ERROR;
            }

            break;
        }
        case MAGNETOMETER_WAIT:
        {
            success = MLX90392_isDataReady();

            //If data is ready
            if (success)
            {
                MLX90392_RawResult magResult;
                MLX90392_NormalizedResults normResult;
                success = MLX90392_getResult(&magResult);
                if (success)
                {
                    windowAlarm_createNormalizedResults(&magResult, &normResult);
                    
                    //If set, print the raw values of the magnetometer
#ifdef MAGNETOMETER_PRINT_CSV
                    sprintf(getCharBufferUSB(), "%d, %d, %d\r\n", magResult.X_Meas, magResult.Y_Meas, magResult.Z_Meas);
                    printBufferedStringUSB();
#elif MAGNETOMETER_RAW_VALUE_PRINT 
                    sprintf(getCharBufferUSB(), "<RAW Values>\r\nX: %d, Y: %d, Z: %d\r\n",
                        magResult.X_Meas, magResult.Y_Meas, magResult.Z_Meas); 
                    printBufferedStringUSB();
                    
                    sprintf(getCharBufferUSB(), "<Normalized Values>\r\nX: %d, Y: %d, Z: %d, R^2: %lu\r\n",
                        normResult.x, normResult.y, normResult.z, normResult.r2);
                    printBufferedStringUSB();
#endif
                    if ((calState == CAL_GOOD) && (!buttonPressed))
                    {
                        //Process Result if Cal is valid
                        windowAlarm_processResults(&normResult);
                    }
                    else
                    {
                        //Calibration Active
                        windowAlarm_runCalibration(&magResult, &normResult);
                        
                    }
                    //magState = MAGNETOMETER_START;
                }
                else
                {
                    //Something went wrong
                    magState = MAGNETOMETER_ERROR;
                }
                
                //Clear Button Press
                buttonPressed = false;
            }
            
            break;
        }
        case MAGNETOMETER_REINIT_WAIT:
        {
            magState = MAGNETOMETER_REINIT;
            break;
        }
        case MAGNETOMETER_REINIT:
        {
            success = MLX90392_init();
            if (success)
            {
                prevResultState = INVALID;
                
                //Attempt to load calibration constants from EEPROM
                windowAlarm_loadFromEEPROM(false);
                
                //Update state machine
                magState = MAGNETOMETER_START;
                magCounter = MAGNETOMETER_ERROR_DELAY;
            }
            else
            {
                magState = MAGNETOMETER_ERROR;
            }
            break;
        }
        case MAGNETOMETER_ERROR:
        default:
        {
            //Simple delay to keep this error from filling the UART.
            if (magCounter >= MAGNETOMETER_ERROR_DELAY)
            {
                printConstantStringBLE("Magnetometer Sensor Error - Reboot Device\r\n");
                magCounter = 1;
            }
            else
            {
                magCounter++;
            }

            break;
        }
    }
}

//Run this ISR if the MVIO changes readiness
void _windowAlarm_onMVIOChange(void)
{
    if (MVIO_isOK() && (magState == MAGNETOMETER_ERROR))
    {
        //Power Restored to MVIO
        magState = MAGNETOMETER_REINIT_WAIT;
    }
    else if (!MVIO_isOK())
    {
        //Loss of Power on MVIO
        magState = MAGNETOMETER_ERROR;
        
        //Triggers immediate message print
        magCounter = MAGNETOMETER_ERROR_DELAY;
    }
    
}